Tekla.Structures.CatalogInternal.ShapeMetadata.#ctor(System.Object,Tekla.Structures.Catalogs.ShapeMetadataTypeEnum,System.String,System.String)
Initializes a new instance of the Tekla.Structures.CatalogInternal.ShapeMetadata class.
val: Metadata value
type: Metadata typeTekla.Structures.Catalogs.ShapeMetadataTypeEnum
label:  Metadata label
description: Metadata description